# ─── Homebrew taps ─────────────────────────────────────────────────────────────
tap "FelixKratz/formulae"

# ─── System utils & setup ────────────────────────────────────────────────────
brew "stow"
brew "grep"
brew "openssh"

# ─── Terminal tools ───────────────────────────────────────────────────────────
brew "tmux"
brew "superfile"
brew "nvim"
brew "eza"
brew "zoxide"
brew "zstd"
brew "lazydocker"
brew "lazygit"
brew "btop"
brew "tree"
brew "as-tree"
brew "zsh"
brew "nushell"

# ─── Development ───────────────────────────────────────────────────────────────
brew "git"
brew "git-lfs"

# ─── JavaScript & runtimes ─────────────────────────────────────────────────────
brew "node"
brew "nvm"

# ─── Custom tools [FelixKratz] ─────────────────────────────────────────────────
brew "sketchybar"
brew "borders"

# ─── Fonts ─────────────────────────────────────────────────────────────────────
cask "font-hack-nerd-font"

# ─── Applications ──────────────────────────────────────────────────────────────
cask "raycast"

